// 苏宁note7 shop
$ (function () {
    var
        Bang = window.Bang || {},
        ShopList = [
            ["鞍山","鞍山解放路店","鞍山市铁东区解放路98号"],
            ["鞍山","鞍山海城店","海城市站前街永安路亨达大厦66号"],
            ["包头","包头钢铁大街店","包头市昆都仑区钢铁大街59号东方明珠广场D座"],
            ["北京","北京良乡大角店","北京市房山区良乡拱辰大街西侧良乡中路北侧，拱辰大街99号"],
            ["北京","北京联想桥店","北京市海淀区中关村东路118号"],
            ["北京","北京刘家窑店","北京市丰台区南三环中路小铁匠营10号"],
            ["北京","北京回龙观店","北京市昌平区回龙观镇回龙观西大街19号北店时代广场D段"],
            ["北京","北京西大望路店","北京市朝阳区西大望路15号院外企大厦A座苏宁"],
            ["北京","北京四季青店","北京市海淀区西四环北路117号"],
            ["北京","北京大兴店","北京市大兴区黄村镇兴政街28号"],
            ["北京","北京慈云寺桥店","北京市朝阳区慈云寺桥东200米"],
            ["北京","北京安贞桥东店","北京市东城区北三环东路33号"],
            ["北京","北京良乡店","北京市房山区良乡镇拱辰大街47号"],
            ["北京","北京广外店","北京市西城区广安门外大街248号（机械大厦负一至三层）"],
            ["北京","北京北太平庄店","北京市海淀区北三环北太平庄路18号城建大厦"],
            ["北京","北京刘家窑东店","北京市丰台区南三环东路27号芳群公寓底商"],
            ["北京","北京望京店","北京市朝阳区广顺北大街望京花园西区116号"],
            ["北京","北京通州西门店","北京市通州区新华西街171号"],
            ["北京","北京马驹桥店","北京市通州区马驹桥镇兴华中街北侧潼关三区9号楼百尚生活广场三层"],
            ["本溪","本溪永丰步行街店","平山区曙光路新天地商贸"],
            ["成都","成都天府立交店","成都市高新区天府大道北段8号苏宁广场"],
            ["成都","成都春熙路店","成都市锦江区红星路三段16号正熙酒店"],
            ["成都","成都都江堰店","成都市都江堰市幸福大道65号"],
            ["成都","成都西大街店","成都市金牛区三洞桥街19号国贸广场"],
            ["成都","成都梁家巷店","成都市金牛区一环路北三段125号南玻商厦（1-2楼）"],
            ["成都","成都双楠店","成都市二环路西段置信路1号置信逸都城"],
            ["成都","成都双流顺城街店","成都市双流县顺城街42号弘民商业广场"],
            ["成都","成都优品道","成都市双流县东升镇白衣上街177号优品道广场"],
            ["成都","成都华阳店","成都市双流县华阳镇正西街43号"],
            ["成都","成都北城天街店","成都市金牛区五块石路１号龙湖北城天街购物广场B1层"],
            ["成都","成都邛崃五彩广场店","成都市邛崃市棉花街34号"],
            ["成都","成都新都马超东路店","马超东路266号"],
            ["成都","成都郫县万达店","望丛东路139号万达广场2号门（1楼）"],
            ["滁州","滁州南谯北路店","滁州市琅琊区南谯北路615号"],
            ["大连","大连西安路店","大连市沙河口区西安路成义街1号民勇嘉泰广场1-5楼"],
            ["东莞","东莞南城鸿福路店","东莞市南城区鸿福路中环财富广场92号一、二、三层"],
            ["佛山","佛山顺德天佑城店","佛山市顺德区容桂街道桂洲大道中63号天佑城首层E区苏宁云商"],
            ["佛山","佛山祖庙路旗舰店","佛山市祖庙路46号华辉大厦1-4层"],
            ["福州","福州中亭街店","福州市八一七中路888号金马大厦119.31382,26.061228"],
            ["福州","福州福新路店","福州市晋安区福新中路89号时代国际广场一楼"],
            ["抚顺","抚顺新城路店","抚顺市顺城区新城路中段31号苏宁电器"],
            ["阜阳","阜阳颍州北路店","阜阳市颍州北路289号苏宁易购"],
            ["广州","广州正佳店","广州市天河路228号正佳广场东侧广晟大厦1-5楼"],
            ["贵阳","贵阳金凤凰店","贵阳市云岩区中华中路98号金凤凰大厦1-4楼"],
            ["贵阳","贵阳喷水池店","延安中路2号喷水池十字路口国贸对面虹祥大厦1-5楼"],
            ["桂林","桂林金马店","桂林市象山区中山中路13号"],
            ["哈尔滨","哈尔滨西大直街店","哈尔滨市南岗区西大直街514号"],
            ["哈尔滨","哈尔滨康安路店","哈尔滨市道里区安阳路1号（康安路与安阳路交叉口）"],
            ["合肥","合肥三里庵店","合肥市蜀山区长江西路304号鑫鹏大厦1-4层"],
            ["合肥","蚌埠东海大道万达广场店","蚌埠市蚌山区东海大道4399号蚌埠苏宁易购万达广场店"],
            ["合肥","合肥宿州路店","合肥市庐阳区宿州路76号宏图大厦一层"],
            ["即墨","即墨红领店","青岛市即墨市烟青路681-20"],
            ["即墨","即墨家佳源","鹤山路999号家佳源购物中心2楼"],
            ["济南","济南泉城路店","济南市历下区泉城路322号"],
            ["济南","济南泉城路二店","济南市历下区泉城路268号"],
            ["胶州","胶州苏州路店","青岛市胶州市苏州路73号"],
            ["胶州","胶州郑州路店","青岛市胶州市郑州东路11号"],
            ["锦州","锦州北镇服务站","北镇办事处南关社区南大街工商行门市楼"],
            ["辽阳","辽阳新华路店","辽阳市文圣区新运大街122号"],
            ["辽阳","辽阳灯塔服务站","灯塔市保险公司交通岗西走20米路北"],
            ["临沂","临沂人民广场店","临沂市兰山区红旗路1号"],
            ["泸州","钟鼓楼店","四川省泸州市江阳区花园路168号"],
            ["绵阳","绵阳金柱园店","绵阳市涪城区剑南路西段65号"],
            ["绵阳","绵阳安昌桥店","绵阳市涪城区长虹大道中段128号"],
            ["南昌","江西南昌东方银座店","南昌市青山湖区北京东路458号"],
            ["南昌","南昌八一广场店","南昌市西湖区广场南路205号"],
            ["南京","南京淮海路店","南京市秦淮区淮海路68号"],
            ["南京","南京迈皋桥店","南京市栖霞区和燕路迈皋桥街71号锦华大厦1-3F"],
            ["南京","南京山西路店","南京市鼓楼区山西路8号金山大厦1-4F"],
            ["南京","南京白下商茂广场店","南京市秦淮区中山南路49号商茂世纪广场"],
            ["南京","南京江东门店","江东南路63号"],
            ["南京","南京大桥北路店","南京市浦口区大桥北路48号弘阳广场A2馆1至3楼"],
            ["南京","南京江浦店","南京市浦口区文德路3号"],
            ["南京","南京江宁店","南京市江宁区金箔路468号"],
            ["南京","南京高淳店","南京市高淳区淳溪镇天河路19号1"],
            ["南宁","南宁朝阳店","南宁市兴宁区人民中路1号"],
            ["南通","南通南大街店","南通市崇川区南大街2号"],
            ["内江","内江百货大楼店","内江市市中区上南街2号"],
            ["内江","内江邱家嘴店","内江市玉溪路377-397号嘉和大厦"],
            ["盘锦","盘锦步行街店","盘锦市兴隆台区步行街中兴路5号"],
            ["青岛","青岛香江路店","香江路88号"],
            ["青岛","青岛李村苏宁电器广场连锁店","青岛市李沧区京口路22-42号"],
            ["青岛","青岛威海路店","青岛市市北区威海路2号"],
            ["青岛","青岛台东店","青岛市市北区台东一路80号"],
            ["青岛","黄岛家佳源","长江中路308号家佳源二楼"],
            ["青岛","城阳店","青岛市城阳区崇阳路498号"],
            ["青岛","辽阳西路店","青岛市市北区辽阳西路100号新业广场2楼"],
            ["青岛","青岛香港中路店","青岛市市南区南京路3号苏宁易购"],
            ["泉州","泉州远太店","泉州市鲤城区温陵南路远太大厦1-3楼"],
            ["深圳","深圳华强北群星广场店","深圳市福田区华强北红荔路38-1群星广场裙楼"],
            ["深圳","深圳沙井万佳店","深圳市宝安区沙井镇新沙路与中心路交汇处深明丰大厦2号铺1F"],
            ["深圳","深圳创业二路店","深圳宝安十区前进一路211号泰华商业城1-2F"],
            ["深圳","深圳龙岗店","深圳市龙岗区龙岗街道深惠公路柏龙购物广场1-3楼"],
            ["深圳","深圳金龙华广场店","深圳市宝安区龙华街道龙观店3号金龙华广场店二期1-3楼"],
            ["深圳","深圳宝安金港华庭店","深圳市宝安区宝安大道4009号金港华庭1-2楼，地铁1号线西乡B出口，地铁11号线碧海湾E出口"],
            ["深圳","深圳龙岗世贸百货店","深圳市龙岗区中心城龙翔大道世贸百货C区四楼"],
            ["深圳","深圳公明建设路店","深圳市光明新区公明街道建设路与金安路交汇处中裕大厦一至三楼"],
            ["深圳","深圳东门店","深圳市新园路7号半岛大厦负一层至三层"],
            ["深圳","深圳石岩宝石南路店","深圳市宝安区石岩宝石南路创富电子广场1-3楼"],
            ["深圳","深圳丽景城店","深圳市宝安76区西乡街道前进二路与西乡大道交汇处丽景城11栋一楼"],
            ["深圳","深圳皇岗福民路店","深圳市福田区福民路与益田路交汇处高发城驰苑1-3楼"],
            ["深圳","深圳沙井市民广场店","深圳市宝安区沙井街道创新路创新花园商业裙楼1-2楼"],
            ["深圳","深圳西乡大道圣淘沙店","西乡大道与新湖路交汇处圣淘沙苏宁1-2楼/地铁1号线至西乡D出口、地铁11号线C出口"],
            ["深圳","深圳布吉信义店","深圳市龙岗区布吉街道百鸽路满庭芳广场1-2层"],
            ["深圳","深圳平湖店","深圳市龙岗区平湖大道守珍街53号原南康百货"],
            ["深圳","深圳华南城易购站","深圳市龙岗区平湖华南城1号交易馆奥特莱斯购购中心负一层中庭"],
            ["深圳","深圳横岗志健广场店","深圳市龙岗区横岗志健广场三楼"],
            ["深圳","深圳龙华世贸店","深圳市龙华新区东环一路龙华世贸广场"],
            ["深圳","深圳新洲店","深圳市福田区新洲三街祥云天都世纪大厦1-2F"],
            ["深圳","深圳布吉东大街店","布吉东大街中翠路大芬地铁站A2出口喜乐购商场内"],
            ["深圳","深圳清湖花半里直营店","深圳市龙华新区清华东路与大和路交界处花半里清湖花园6栋A31.A32号"],
            ["深圳","深圳坂田诺德中央道服务站","坂田街道永香路诺德中央道一期裙楼2号楼层103商铺"],
            ["深圳","深圳光明服务站","光明新区牛山科技园南侧传麒山12栋首层102、103部分物业"],
            ["沈阳","沈阳东中街店","沈阳市大东区东顺城街17号"],
            ["沈阳","长江街店","沈阳市皇姑区长江街60号甲中乾商务花园1-2层"],
            ["沈阳","沈阳文化大楼店","沈阳市沈河区中街路77号"],
            ["沈阳","沈阳苏家屯店","沈阳市苏家屯区枫杨路45号商业大厦1-3楼"],
            ["沈阳","铁西万达店","兴华南街58号万达广场1楼"],
            ["沈阳","太原街店","沈阳市和平区中华路57号金杯大厦1-4楼"],
            ["沈阳","三好街店","沈阳市和平区三好街55号信息产业大厦1F-3F(医大二院斜对面)"],
            ["沈阳","沈阳铁西广场店","沈阳市铁西区兴华街5号"],
            ["沈阳","鞍山二道街店","鞍山市铁东区二道街30号"],
            ["沈阳","沈阳奥体万达广场店","营盘街17号奥体万达广场二楼苏宁易购"],
            ["沈阳","沈北新区道义服务站","道义南大街10-15号3门"],
            ["沈阳","铁西区沈辽路服务站","沈辽路107号福隆雅居正门"],
            ["石家庄","石家庄苏宁生活广场店","石家庄市中山西路77号老火车站广场北侧"],
            ["石家庄","石家庄西美大厦店","石家庄市桥西区建设南大街6号西美大厦"],
            ["苏州","苏州石路步行街店","苏州市姑苏区金门路158号石路步行街路口"],
            ["苏州","苏州观前街店","苏州市姑苏区人民路1351号"],
            ["太原","太原汾酒大厦店","太原市解放路38号"],
            ["唐山","唐山远洋城店","唐山市路北区建设路128号远洋城购物中心内"],
            ["天津","天津塘沽金街店","天津市塘沽区解放路588号"],
            ["天津","天津塘沽店","天津市塘沽区河北路1629号新洋家具广场2层"],
            ["天津","天津海光寺店","天津市和平区卫津路73号嘉利中心1-4楼"],
            ["天津","天津荣业大街店","天津市和平区荣业大街156号"],
            ["天津","天津南楼店","天津市河西区大沽南路826号"],
            ["无锡","无锡购物中心店","无锡市崇安区人民中路111号"],
            ["武汉","武汉解放大道店","武汉市江汉区解放大道557号中山广场1-4楼"],
            ["武汉","武汉唐家墩店","武汉市江汉区新华下路299号顶秀晶城"],
            ["武汉","武汉中南店","武汉市洪山区中南路中建广场6-1"],
            ["武汉","武汉徐东店","武汉市友谊大道508号万利广场"],
            ["武汉","武汉光谷店","武汉市洪山区民院路光谷广场特1号"],
            ["武汉","武汉硚口竹叶海店","武汉市硚口区长宜路1号宜家荟聚购物中心四楼"],
            ["武汉","武汉青山沿港路店","武汉市青山区红钢城街道沿港路3号苏宁电器"],
            ["武汉","武汉江夏中央大街店","武汉市江夏区纸坊街江夏大道中央大厦"],
            ["武汉","武汉菱角湖店","武汉市江汉区新华下路169号菱湖上品1楼"],
            ["武汉","武汉沌口店","武汉市汉阳区汉阳经济技术开发区宁康路58号湘隆时代商业中心"],
            ["武汉","武汉百步亭店","武汉市江岸区后湖大道特8号1-2楼"],
            ["西安","西安金花路店","西安市新城区金花北路169号天彩大厦（金花路与长乐路十字东南角天彩大厦）"],
            ["西安","西安钟楼二店","西安市莲湖区北大街2号"],
            ["西安","西安电子城店","西安市雁塔区电子二路电子城步行街南口群力大厦"],
            ["西安","西安未央路店","西安市未央区凤城一路赛高国际1层苏宁（雅荷花园对面）"],
            ["西安","西安北大街店","西安市莲湖区北大街85号"],
            ["西安","西安长安步行街店","西安市长安区长安步行街中段太阳新城36号（新华街与步行街什字西北角）"],
            ["西安","西安张家堡店","西安市未央区凤城九路张家堡转盘西北角海荣名城商业楼（海博广场1-4层）"],
            ["西安","西安南二环店","西安市雁塔区南二环西段118号安馨园大厦"],
            ["西安","西安东二环店","西安市碑林区金花南路6号立丰国际一楼"],
            ["西安","西安南三环店","西安市雁塔区长安南路131号金品国际1，2，3层（地铁二号线国际会展中心C出口向南300米）"],
            ["西安","西安莲湖路店","西安市莲湖区莲湖路23号（北大街与莲湖路十字向西100米路北）"],
            ["西安","西安土门店","西安市莲湖区西二环南段22号新荣基大厦苏宁1-3楼"],
            ["宿迁","宿迁苏宁广场店","宿迁市宿城区幸福路88号"],
            ["徐州","徐州古彭广场店","徐州市淮海西路18号和信大厦"],
            ["扬州","扬州仪征解放东路店","扬州市仪征市工农南路128号"],
            ["宜宾","宜宾大观楼百货大楼店","宜宾市翠屏区民主路19号宜宾大观楼百货大楼店原洋洋百货1-3楼"],
            ["宜昌","宜昌CBD店","宜昌市西陵区夷陵大道56号大洋百货负一楼"],
            ["银川","银川步行街店","银川市兴庆区利群东街121号"],
            ["长春","长春重庆路店","长春市朝阳区重庆路1388号"],
            ["长春","重庆路鸿源广场店","长春市朝阳区西安大路8号"],
            ["长春","住邦城市广场","长春市宽城区青年路与新月路交会处住邦城市广场四楼"],
            ["长沙","长沙五一广场店","长沙市芙蓉区黄兴中路80号五一广场"],
            ["长沙","长沙东塘店","长沙市雨花区劳动西路523号中天电力大厦临街1到4楼"],
            ["长沙","长沙湘江世纪城分店","长沙市开福区金霞新区22号世纪金源购物中心苏宁易购"],
            ["长沙","长沙星沙店","长沙市长沙县星沙店凉塘路与板仓路交汇处苏宁"],
            ["镇江","镇江大市口店","镇江市京口区中山东路256号"],
            ["郑州","郑州二七广场店","郑州市二七区二七广场德化街45号"],
            ["郑州","郑州南阳路店","郑州市金水区南阳路与跃进路交叉口南阳路84号"],
            ["郑州","郑州棉纺路店","郑州市二七区棉纺东路26号苏宁易购"],
            ["重庆","重庆观音桥步行街店","重庆市江北区观音桥步行街9号嘉年华大厦"],
            ["重庆","重庆南坪店","重庆市南岸区南坪西路23号金台大厦"],
            ["重庆","重庆南岸区南坪西路店","重庆市南岸区惠工路1号建玛特灯饰广场B座"],
            ["重庆","重庆沙坪坝店","重庆市沙坪坝区渝碚路85号"],
            ["重庆","重庆杨家坪店","重庆市九龙坡区杨家坪前进支路1号跃华大厦"],
            ["重庆","重庆沙坪坝三峡广场店","重庆市沙坪坝区华宇广场3号（家乐福楼上）"],
            ["重庆","重庆红旗河沟店","重庆市江北区红石路2号"],
            ["重庆","重庆解放碑步行街店","重庆市渝中区解放碑八一路177号雨田大厦"],
            ["株洲","株洲神农太阳城店","株洲市天元区泰山西路炎帝广场银座"],
            ["自贡","汇东路店","自贡市汇东新区汇东路丹桂街东段68号泰丰大厦１区"],
            ["杭州","杭州庆春路店","杭州市下城区庆春路嘉德广场122号裙楼"],
            ["杭州","杭州公司生活广场店","杭州市拱墅区湖墅南路90号"],
            ["杭州","杭州萧山市心中路店","杭州市萧山区市心中路789号"],
            ["杭州","杭州江南大道店","杭州市滨江区江南大道288号"],
            ["杭州","杭州新塘路店","杭州市江干区新塘路111号新城时代广场2号楼"],
            ["杭州","杭州城北钱江店","杭州市拱墅区上塘路456号钱江市场二楼"],
            ["上海","上海浦东第一店","上海市浦东新区南泉北路569号"],
            ["上海","上海长宁路店","上海市长宁区长宁路999号"],
            ["上海","上海五角场店","上海市杨浦区邯郸路585号"],
            ["上海","上海奉贤南桥店","上海市奉贤区南桥镇南奉公路9269号"],
            ["上海","上海中山中路店","上海市松江区中山中路231号(良友商厦)"],
            ["上海","公园路店","上海市青浦区公园路458号凯特利广场"]
        ];

    function convertShopList(arr){
        var obj={};
        for(var i=0;i<arr.length;i++){
            var arr2 = arr[i];
            if (!obj[arr2[0]]){
                obj[arr2[0]] = [];
            }
            obj[arr2[0]].push([arr2[1],arr2[2]]);
        }
        return obj;
    }

    var ShopList = convertShopList(ShopList);

    // 城市选择
    initCitySelect ();

    function initCitySelect () {

        var
            province = '',
            city = '',
            area = '',
            options = {
                // 实例化的时候自动执行init函数
                flagAutoInit     : true,
                selectorTrigger  : '.trigger-select-province-city-area',
                //selectorProvince : '[name="receiver_province_id"]',
                //selectorCity     : '[name="receiver_city_id"]',
                //selectorArea     : '[name="receiver_area_id"]',
                province         : province,
                city             : city,
                area             : area,
                //show_city        : false,
                show_area        : false,
                callback_cancel  : null,
                callback_confirm : function (region) {
                    $('.block-shop-list').html('');
                    region = region || {}

                    var
                        city = region[ 'city' ],
                        city_shop_list = ShopList[city];
                    if(city_shop_list){
                        var html_str = $.tmpl( $.trim($('#JsSuningNote7ShopListTpl').html()))({
                            'shopList':city_shop_list
                        });
                        $('.block-shop-list').html(html_str);

                        $.scrollTo({
                            endY : $(".block3").offset().top,
                            duration: 800
                        });
                    }else{

                        $('.block-shop-list').html('<div class="no-shop-tips">抱歉，您所在城市没有参与活动的门店，您可以登录<a href="http://hx.suning.com" style="color:#ffeb9d;text-decoration: underline;">易购官网</a>参与以旧换新</div>');
                    }

                }
            }

        // 初始化省/市/区县选择器
        Bang.AddressSelect (options);
    }

})

;
(function () {
    wx.ready (function () {
        var noop = function () {};
        var wxData = {};

        // 微信分享的数据
        wxData = {
            "title"   : "三星Galaxy Note7以旧换新，到店有礼！",
            "desc"    : "苏宁与同城帮联合推出：三星Galaxy Note7到店以旧换新，补贴200元，再享6重大礼！",
            "link"    : window.location.href,
            "imgUrl"  : 'https://p.ssl.qhimg.com/t0110cda9b8c00eb42f.png',
            "success" : noop, // 用户确认分享的回调
            "cancel"  : noop // 用户取消分享
        };

        // 用户点开右上角popup菜单后，点击分享给好友，会执行下面这个代码
        wx.onMenuShareAppMessage (wxData);
        // 点击分享到朋友圈，会执行下面这个代码
        wx.onMenuShareTimeline (wxData);
        //分享到QQ
        wx.onMenuShareQQ (wxData);
    });

} ())
